
#### Terraform fmt check `success`
#### Terraform init `success`
#### Terraform validate `success`
#### Terraform plan `success`
<details>
  <summary>Show Plan</summary>
  
  ```
    module.root.google_project_iam_custom_role.github_actions_read_only_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_only_role]
module.root.google_service_account.github_actions_read_only_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_service.iam: Refreshing state... [id=company-official-app-dev/iam.googleapis.com]
module.root.google_service_account.github_actions_read_write_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_custom_role.github_actions_read_write_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_write_role]
module.root.google_project_service.service_usage: Refreshing state... [id=company-official-app-dev/serviceusage.googleapis.com]
module.root.google_project_service.resource_manager: Refreshing state... [id=company-official-app-dev/cloudresourcemanager.googleapis.com]
module.root.google_storage_bucket.manage_tfstate: Refreshing state... [id=tfstate-coa-dev]
module.root.google_project_iam_member.github_actions_read_only_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_only_role/serviceAccount:github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_member.github_actions_read_write_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_write_role/serviceAccount:github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_sql_database_instance.app_mysql_instance will be created
  + resource "google_sql_database_instance" "app_mysql_instance" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "app-mysql-01"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "asia-northeast1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = "ALWAYS"
          + authorized_gae_applications = (known after apply)
          + availability_type           = "ZONAL"
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = false
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_HDD"
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + start_time                     = "00:00"
              + transaction_log_retention_days = 1

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + database_flags {
              + name  = "sql_mode"
              + value = "TRADITIONAL,NO_AUTO_VALUE_ON_ZERO,ONLY_FULL_GROUP_BY"
            }
          + database_flags {
              + name  = "slow_query_log"
              + value = "on"
            }
          + database_flags {
              + name  = "log_output"
              + value = "FILE"
            }
          + database_flags {
              + name  = "innodb_lock_wait_timeout"
              + value = "10"
            }
          + database_flags {
              + name  = "long_query_time"
              + value = "1"
            }

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = (known after apply)
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }

          + maintenance_window {
              + day  = 1
              + hour = 21
            }
        }
    }

  # module.root.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + description        = "CloudSQLのプライベートネットワーク接続用"
      + id                 = (known after apply)
      + name               = "private-ip-address"
      + network            = (known after apply)
      + prefix_length      = 20
      + project            = (known after apply)
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.root.google_compute_network.private_network will be created
  + resource "google_compute_network" "private_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "CloudSQLのプライベートネットワーク接続用"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "private-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.root.google_project_iam_custom_role.github_actions_read_only_role will be updated in-place
  ~ resource "google_project_iam_custom_role" "github_actions_read_only_role" {
        id          = "projects/company-official-app-dev/roles/github_actions_read_only_role"
        name        = "projects/company-official-app-dev/roles/github_actions_read_only_role"
      ~ permissions = [
          + "cloudsql.databases.get",
          + "cloudsql.databases.list",
          + "cloudsql.instances.get",
          + "cloudsql.instances.list",
          + "cloudsql.users.list",
          + "compute.globalAddresses.get",
          + "compute.networks.get",
          + "servicenetworking.services.get",
            # (13 unchanged elements hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # module.root.google_project_iam_custom_role.github_actions_read_write_role will be updated in-place
  ~ resource "google_project_iam_custom_role" "github_actions_read_write_role" {
        id          = "projects/company-official-app-dev/roles/github_actions_read_write_role"
        name        = "projects/company-official-app-dev/roles/github_actions_read_write_role"
      ~ permissions = [
          + "cloudsql.databases.create",
          + "cloudsql.databases.delete",
          + "cloudsql.databases.get",
          + "cloudsql.databases.list",
          + "cloudsql.databases.update",
          + "cloudsql.instances.connect",
          + "cloudsql.instances.create",
          + "cloudsql.instances.delete",
          + "cloudsql.instances.get",
          + "cloudsql.instances.list",
          + "cloudsql.instances.update",
          + "cloudsql.users.create",
          + "cloudsql.users.delete",
          + "cloudsql.users.list",
          + "cloudsql.users.update",
          + "compute.globalAddresses.createInternal",
          + "compute.globalAddresses.deleteInternal",
          + "compute.globalAddresses.get",
          + "compute.networks.create",
          + "compute.networks.delete",
          + "compute.networks.get",
          + "compute.networks.removePeering",
          + "compute.networks.use",
          + "servicenetworking.services.addPeering",
          + "servicenetworking.services.addSubnetwork",
          + "servicenetworking.services.get",
            # (25 unchanged elements hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # module.root.google_project_service.cloud_sql_admin will be created
  + resource "google_project_service" "cloud_sql_admin" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "company-official-app-dev"
      + service                    = "sqladmin.googleapis.com"
    }

  # module.root.google_project_service.service_networking will be created
  + resource "google_project_service" "service_networking" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "company-official-app-dev"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.root.google_service_networking_connection.private_connection will be created
  + resource "google_service_networking_connection" "private_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "private-ip-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 6 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

    
  ```

</details>